-- phpMyAdmin SQL Dump
-- version 4.8.2
-- https://www.phpmyadmin.net/
--
-- Хост: 127.0.0.1
-- Время создания: Окт 13 2018 г., 10:18
-- Версия сервера: 10.1.34-MariaDB
-- Версия PHP: 7.2.7

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
SET AUTOCOMMIT = 0;
START TRANSACTION;
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- База данных: `clients_database`
--

-- --------------------------------------------------------

--
-- Структура таблицы `cars`
--

CREATE TABLE `cars` (
  `id` int(10) UNSIGNED NOT NULL,
  `make` varchar(255) COLLATE utf8mb4_unicode_ci NOT NULL,
  `model` varchar(255) COLLATE utf8mb4_unicode_ci NOT NULL,
  `year` int(11) DEFAULT NULL,
  `state_number` varchar(255) COLLATE utf8mb4_unicode_ci NOT NULL,
  `ecu_name` varchar(255) COLLATE utf8mb4_unicode_ci DEFAULT NULL,
  `chiptuned` tinyint(1) NOT NULL,
  `deleted_at` timestamp NULL DEFAULT NULL,
  `created_at` timestamp NULL DEFAULT NULL,
  `updated_at` timestamp NULL DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- Дамп данных таблицы `cars`
--

INSERT INTO `cars` (`id`, `make`, `model`, `year`, `state_number`, `ecu_name`, `chiptuned`, `deleted_at`, `created_at`, `updated_at`) VALUES
(12, 'ГАЗ', 'Ель', 2006, 'СА1773АI', 'Микас 7.1', 1, NULL, '2018-08-23 05:56:40', '2018-08-23 05:56:40'),
(13, 'Daewoo', 'Lanos', 2004, 'CA1078CA', NULL, 0, NULL, '2018-08-30 10:10:57', '2018-08-30 10:10:57'),
(14, 'ЛАДА', 'Приора', 2011, 'CA4234CM', 'M73', 0, NULL, '2018-08-30 10:35:31', '2018-08-31 03:54:02'),
(15, 'Skoda', 'Octavia', NULL, 'CA2537CA', NULL, 0, NULL, '2018-09-01 07:20:33', '2018-09-01 07:20:33'),
(16, 'ВАЗ', '2107', 2005, 'CA1661AC', 'Карбюратор', 0, NULL, '2018-09-03 06:05:49', '2018-09-03 06:05:49'),
(17, 'ВАЗ', '2115', 2011, 'СА2396ВЕ', 'Bosch ME17.9.7', 1, NULL, '2018-09-03 08:20:37', '2018-09-03 08:48:39'),
(18, 'Toyota', 'Corola', 2007, 'CA8022BA', NULL, 0, NULL, '2018-09-04 04:24:49', '2018-09-04 04:39:21'),
(19, 'Skoda', 'Octavia', 2003, 'CA2330BA', NULL, 0, NULL, '2018-09-04 08:33:45', '2018-09-04 08:34:00'),
(21, 'Nissan', 'X-Trail', 2007, 'CA6869BB', NULL, 0, NULL, '2018-09-04 10:57:35', '2018-09-04 11:03:13'),
(22, 'ZAZ', 'Vida(Aveo)', 2012, 'CA4784EB', 'Микас 10.3(М114)', 0, NULL, '2018-09-05 03:40:32', '2018-09-05 03:40:32'),
(23, 'Audi', 'A6', 2003, 'CA0006AX', NULL, 0, NULL, '2018-09-05 03:49:34', '2018-09-05 03:49:34'),
(24, 'ВАЗ', '2108', 1987, 'CA6170AH', 'Карблюратор', 0, NULL, '2018-09-05 07:25:32', '2018-09-05 07:25:32'),
(25, 'Cherry', 'Tiggo', 2008, 'CA9757BT', NULL, 1, NULL, '2018-09-05 08:44:10', '2018-09-05 08:44:10'),
(26, 'Hundai', 'Elantra', 2008, 'CA3552CA', NULL, 0, NULL, '2018-09-05 10:48:41', '2018-09-05 10:48:41'),
(27, 'Kia', 'Rio', 2012, 'CA9585CB', NULL, 0, NULL, '2018-09-05 11:33:19', '2018-09-05 11:33:19'),
(28, 'Hundai', 'Santa-Fe', 2008, 'CA4646BO', NULL, 0, NULL, '2018-09-06 05:30:51', '2018-09-06 05:31:52'),
(29, 'ВАЗ', '2110', 2013, 'CA6792BC', 'M73 E3', 1, NULL, '2018-09-06 08:49:15', '2018-09-06 09:00:44'),
(30, 'Toyota', 'Camry', 2002, 'CA2611CE', NULL, 0, NULL, '2018-09-06 12:00:04', '2018-09-06 12:00:04'),
(31, 'Kia', 'Sorento', 2007, 'CA2000BC', NULL, 0, NULL, '2018-09-06 12:10:35', '2018-09-06 12:10:35'),
(32, 'ZAZ', 'Forza', 2011, 'CA2914BE', NULL, 0, NULL, '2018-09-07 07:19:11', '2018-09-07 07:19:11'),
(33, 'Renaught', 'Scenic', 2005, 'WNZ571', NULL, 0, NULL, '2018-09-07 09:22:24', '2018-09-07 09:22:24'),
(34, 'ВАЗ', '2111', 2006, 'CA3711BB', 'M73', 0, NULL, '2018-09-08 05:35:26', '2018-09-08 06:56:08'),
(35, 'Mitsubishi', 'Lancer', 2007, 'AH0405CM', NULL, 0, NULL, '2018-09-08 08:43:42', '2018-09-08 08:43:42'),
(36, 'Cherry', 'Eastar', 2007, 'AH0415EO', NULL, 1, NULL, '2018-09-10 07:33:49', '2018-09-10 07:33:49'),
(37, 'Hundai', 'Tucson', 2007, 'AH2839IP', NULL, 0, NULL, '2018-09-11 04:14:55', '2018-09-11 04:31:09'),
(38, 'Skoda', 'Fabia', 2002, 'CA2882BB', NULL, 0, NULL, '2018-09-12 03:27:28', '2018-09-12 03:27:28'),
(39, 'Renaught', 'Logan', 2009, 'BA4604AP', NULL, 0, NULL, '2018-09-12 10:12:59', '2018-09-12 10:12:59'),
(40, 'ZAZ', 'Sens', 2010, 'CA2359BC', NULL, 0, NULL, '2018-09-13 06:23:15', '2018-09-13 06:23:15'),
(41, 'ZAZ', 'Vida(Aveo)', 2012, 'Y6DF48Y0C0004041', NULL, 0, NULL, '2018-09-13 07:48:04', '2018-09-13 07:48:04'),
(42, 'Hundai', 'Elantra', 2008, 'CA8460AP', NULL, 0, NULL, '2018-09-14 14:55:27', '2018-09-14 14:55:27'),
(43, 'ВАЗ', '2104', 2004, '900-78MA', NULL, 0, NULL, '2018-09-15 10:09:37', '2018-09-15 10:09:37'),
(44, 'Toyota', 'Highlander', 2012, 'CA1888BH', NULL, 0, NULL, '2018-09-17 06:19:17', '2018-09-17 06:19:17'),
(45, 'Mitsubishi', 'Outlander-1', 2006, 'CA8400CA', NULL, 0, NULL, '2018-09-17 07:06:24', '2018-09-17 07:06:24'),
(46, 'Lada', 'Kalina', 2008, 'CA8927AX', 'Bosch 7.9.7 E2', 1, NULL, '2018-09-17 10:39:44', '2018-09-17 10:42:12'),
(47, 'Skoda', 'Superb', 2003, 'CA9007AA', NULL, 0, NULL, '2018-09-18 06:45:00', '2018-09-19 05:30:07'),
(48, 'Chevrolet', 'Aveo', 2007, 'CA0293BM', NULL, 0, NULL, '2018-09-18 06:47:41', '2018-09-18 06:47:41'),
(49, 'Chevrolet', 'Lachetti', 2005, 'CA4428BM', NULL, 0, NULL, '2018-09-18 08:01:29', '2018-09-18 08:01:29'),
(50, 'Mitsubishi', 'Outlander-1', 2006, 'CA0380AX', NULL, 0, NULL, '2018-09-19 07:23:01', '2018-09-19 07:23:01'),
(51, 'Hundai', 'Elantra', 2012, 'CA7533BH', NULL, 0, NULL, '2018-09-20 03:34:20', '2018-09-20 03:34:20'),
(52, 'Mersedes', 'W230', 1996, 'CA9330BO', NULL, 0, NULL, '2018-09-20 08:33:17', '2018-09-20 08:33:17'),
(53, 'Toyota', 'Lexus ES 300', 2003, 'CA3082BX', NULL, 0, NULL, '2018-09-20 10:45:37', '2018-09-20 10:45:37'),
(54, 'Daewoo', 'Lanos', 2007, 'CA4414AM', NULL, 1, NULL, '2018-09-21 05:59:42', '2018-09-21 06:03:35'),
(55, 'Renaught', 'Logan', NULL, 'BB1098CB', NULL, 0, NULL, '2018-09-21 09:56:22', '2018-09-21 09:56:22'),
(56, 'Chevrolet', 'Laccetti', 2007, 'CA6990AM', NULL, 0, NULL, '2018-09-21 10:50:52', '2018-09-21 10:50:52'),
(57, 'ГАЗ', 'Ель', 2008, 'CA5733AX', NULL, 0, NULL, '2018-09-21 11:04:12', '2018-09-21 11:04:12'),
(58, 'Geelly', 'Emgrand 7', 2012, 'CA2543CE', NULL, 0, NULL, '2018-09-26 08:44:23', '2018-09-26 08:44:23'),
(59, 'Chevrolet', 'Laccetti', 2012, 'CA5552BE', NULL, 0, NULL, '2018-09-27 06:03:15', '2018-09-27 06:03:15'),
(60, 'Mitsubishi', 'Lanser CS', 2007, 'CA4087CM', NULL, 0, NULL, '2018-09-27 10:06:13', '2018-09-27 11:22:50'),
(61, 'Kia', 'Rio', 2012, 'CA9797BE', NULL, 0, NULL, '2018-09-27 12:35:22', '2018-09-27 12:35:22'),
(62, 'Toyota', 'Camry', NULL, 'CA2577CE', NULL, 0, NULL, '2018-09-28 06:55:21', '2018-09-28 06:55:21'),
(63, 'Toyota', 'Land Cruiser', 2013, 'CA2224AE', NULL, 0, NULL, '2018-09-29 05:20:58', '2018-09-29 05:20:58'),
(64, 'Daewoo', 'Sens', 2004, 'CA0410BH', NULL, 0, NULL, '2018-10-01 08:58:29', '2018-10-01 08:58:29'),
(65, 'Mazda', 'Primacy', 2005, 'CA9403BM', NULL, 0, NULL, '2018-10-01 11:37:58', '2018-10-01 11:37:58'),
(66, 'Toyota', 'Land Cruiser', 2008, 'CA5556CE', NULL, 0, NULL, '2018-10-03 09:13:00', '2018-10-03 09:13:00'),
(67, 'Honda', 'CR-V', NULL, 'CA6350CE', NULL, 0, NULL, '2018-10-04 05:06:55', '2018-10-04 05:06:55'),
(68, 'Daewoo', 'Sens', 2005, 'CA9156AE', NULL, 0, NULL, '2018-10-05 06:30:49', '2018-10-05 06:41:07'),
(69, 'Kia', 'Rio', 2010, 'CA8928CB', NULL, 0, NULL, '2018-10-06 04:53:28', '2018-10-06 04:53:28'),
(70, 'Subaru', 'Forester', 2004, 'CA1213AT', NULL, 0, NULL, '2018-10-08 10:50:44', '2018-10-08 10:50:44'),
(71, 'Hundai', 'Accent', 2008, 'CA9038CB', NULL, 0, NULL, '2018-10-09 07:08:26', '2018-10-09 07:08:26'),
(72, 'Kia', 'Rio', 2006, 'CA6029AT', NULL, 0, NULL, '2018-10-11 03:34:43', '2018-10-11 03:34:43'),
(73, 'Kia', 'Magentis', 2007, 'CA5162BX', NULL, 1, NULL, '2018-10-11 08:10:50', '2018-10-11 08:10:50'),
(74, 'Honda', 'CR-V', 2008, 'CA4318BX', NULL, 0, NULL, '2018-10-11 11:29:44', '2018-10-11 11:29:44'),
(75, 'Daewoo', 'Lanos', 2005, 'CA0214AA', NULL, 0, NULL, '2018-10-11 12:13:06', '2018-10-11 12:13:06'),
(76, 'Subaru', 'Outback', 2004, 'CA6044CA', NULL, 0, NULL, '2018-10-12 09:50:14', '2018-10-12 09:50:14');

-- --------------------------------------------------------

--
-- Структура таблицы `visits`
--

CREATE TABLE `visits` (
  `id` int(10) UNSIGNED NOT NULL,
  `odometer_reading` int(11) NOT NULL,
  `errors_petrol` text COLLATE utf8mb4_unicode_ci,
  `errors_gas` text COLLATE utf8mb4_unicode_ci,
  `work_petrol` text COLLATE utf8mb4_unicode_ci,
  `work_gas` text COLLATE utf8mb4_unicode_ci,
  `notes` text COLLATE utf8mb4_unicode_ci,
  `car_id` int(11) UNSIGNED DEFAULT NULL,
  `created_at` timestamp NULL DEFAULT NULL,
  `updated_at` timestamp NULL DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- Дамп данных таблицы `visits`
--

INSERT INTO `visits` (`id`, `odometer_reading`, `errors_petrol`, `errors_gas`, `work_petrol`, `work_gas`, `notes`, `car_id`, `created_at`, `updated_at`) VALUES
(5, 708900, NULL, 'Нет массы на газовых клапанах пропан.\r\nЗагрязнён фильтр в клапане.\r\nПлохой контакт плюсовой клеммы не метановом редукторе.', NULL, 'Замена фильтра паровой фазы, пропан.\r\nЗамена проводки и клемм.', NULL, 12, '2018-08-23 09:00:00', NULL),
(6, 323593, '-', 'Жалобы на неустойчивый холостой ход', 'Замена свечей, чистка РХХ', 'ТО редуктора, замена фильтра жидкой фазы, устраниение подсоса воздуха по газ., смесителю, переделка \"массы\" ГБО, замена резинки антихлопка', 'В редукторе установлен неоригинальный клапан во второй ступени(толщина меньше чем в ремкомплекте)', 13, '2018-08-30 10:13:10', '2018-08-30 10:16:42'),
(8, 84640, '-', 'Нет газовой форсунки 2, низкое напряжение, снимался аккумулятор, слетела газовая карта', 'Закрепили корпус воздушного фильтра', 'Подрезали крышку двигателя, чтобы не сбивала фишку форсунки.', '', 14, '2018-08-30 10:37:48', '2018-08-31 03:53:28'),
(9, 174549, 'Не работает лямбда зонд', '-', '-', 'Замена редуктора(редуктор клиента), удлиннение трубки подачи газа. Замена фильта паровой фазы (тонкой очистки).', NULL, 15, '2018-09-01 07:22:29', '2018-09-01 07:22:29'),
(10, 86848, NULL, 'Не стабильно работает на газу (пробег редуктора 90000км)', NULL, 'Переборка редуктора(установка ремкомплекта), замена магистрального клапана.', NULL, 16, '2018-09-03 06:07:32', '2018-09-03 06:08:10'),
(11, 144315, 'Пропуски воспламенения 1,3,4 цилиндры в незначительном количестве', 'Неустойчивый холостой ход. Ошибка напряжения.', NULL, 'Замена фильтров жидкой и паровой фазы', NULL, 17, '2018-09-03 08:21:45', '2018-09-03 08:51:09'),
(12, 106819, NULL, 'Низкая температура газа', NULL, 'Регулировка и проверка настроек в движении', 'Очень богатая смесь в режиме высоких нагрузок', 18, '2018-09-04 04:26:35', '2018-09-04 04:56:11'),
(13, 188322, 'Бедная смесь', 'Обнаружен подсос воздуха по штуцерам газовой врезки во впускной коллектор', NULL, 'Проверка и регулировка газовых форсунок.\r\nРегулировка в ходу.\r\nЗамена фильтра жидкой фазы', NULL, 19, '2018-09-04 08:34:31', '2018-09-04 09:31:32'),
(14, 181000, NULL, NULL, NULL, 'Замена фильтра паровой фазы', NULL, 21, '2018-09-04 10:58:48', '2018-09-04 10:58:48'),
(15, 69749, 'Пропуск зажигания по 4-му цилиндру', 'Низкое напряжение', 'Замена свечей.', 'Регулировка хода штока газовых форсунок.\r\nОбкатка, регулировка в движении.', NULL, 22, '2018-09-05 03:41:17', '2018-09-05 05:19:21'),
(16, 24791, NULL, NULL, 'Замена свечей', 'ТО редуктора', 'Верхний прибалтийский смеситель', 24, '2018-09-05 07:26:15', '2018-09-05 07:27:43'),
(17, 139567, NULL, NULL, NULL, NULL, NULL, 25, '2018-09-05 08:44:30', '2018-09-05 08:44:30'),
(18, 154752, 'Множественные пропуски воспламенения, пропуски воспламенения по 3 цил', NULL, NULL, 'Замена форсунки газовой форсунки 4-го цилиндра', NULL, 26, '2018-09-05 10:49:50', '2018-09-05 10:50:10'),
(19, 45986, NULL, NULL, NULL, 'Автокалибровка и настройка в движени', NULL, 27, '2018-09-05 11:34:31', '2018-09-05 11:34:31'),
(20, 139012, NULL, 'Обрыв электроклапана 1, Температура редуктора выше нормы, Давление в коллекторе выше нормы.', NULL, 'Обкатка', 'Машина после регулировки клапанов, в конфигурации стояли форсунки 3 Ом вмместо 1,9 Ом.\r\nМашина \"безлямбдовая\".', 28, '2018-09-06 05:32:12', '2018-09-06 05:56:58'),
(21, 325323, NULL, NULL, NULL, 'Регулировка по ШДК', NULL, 13, '2018-09-06 06:20:19', '2018-09-06 06:20:19'),
(22, 150000, 'Датчик температуры ОЖ высокий уровень сигнала, Пропуски воспламенения, Пропуски 1,2 цил.Низкое напряжение бортовой сети', 'Ошибка напряжения, ошибка форсунок 1,2,3,4', NULL, 'Перепутаны 1 и 2 газовые форсунки - устранили', NULL, 29, '2018-09-06 08:52:29', '2018-09-06 12:01:51'),
(23, 234950, NULL, 'Низкое давление газа(приехал без газа)', NULL, 'Замена фильтров тонкой и грубой очистки', NULL, 30, '2018-09-06 12:01:14', '2018-09-06 12:01:14'),
(24, 182136, 'P0082 - цепь управления впускным клапаном низкий уровень', NULL, NULL, 'Регулировка после ненашей замены форсунок', NULL, 31, '2018-09-06 12:12:03', '2018-09-06 13:01:23'),
(25, 59865, NULL, NULL, NULL, 'Регулировка, проверка в движении', NULL, 32, '2018-09-07 07:24:38', '2018-09-07 07:28:33'),
(26, 217660, NULL, NULL, NULL, NULL, 'OBD - долгосрочнай коррекция +45%, +49%', 33, '2018-09-07 09:23:50', '2018-09-07 09:23:50'),
(27, 157206, NULL, NULL, NULL, 'Переборка редуктора NLP', NULL, 34, '2018-09-08 05:36:40', '2018-09-08 05:36:40'),
(28, 225072, NULL, NULL, NULL, 'Регулировка, обкатка.', 'Слабая реакция лямбда-зонда на обогащение смеси на газу', 35, '2018-09-08 08:44:39', '2018-09-08 09:23:26'),
(29, 18039, NULL, NULL, NULL, 'Замена фильтра тонкой очистки', NULL, 36, '2018-09-10 07:34:23', '2018-09-10 07:35:12'),
(30, 189468, 'Датчик кислорода низкий отклик.', NULL, NULL, 'Обтяжка хомутов.\r\nУстранение утечки по высокому давлению на входе в редуктор.\r\nЗамена фильтра тонкой очистки. \r\nРегулировка в движении.', 'Медленный отклик лямбды под нагрузкой', 37, '2018-09-11 04:31:37', '2018-09-11 04:38:23'),
(31, 157206, NULL, NULL, NULL, 'Регулировка газовых форсунок, регулировка в движении', 'Не работает спидометр', 34, '2018-09-11 06:41:18', '2018-09-11 07:21:50'),
(32, 14645, NULL, NULL, NULL, 'Замена катушки на газовом клапане', NULL, 38, '2018-09-12 03:28:15', '2018-09-12 03:28:15'),
(33, 211624, NULL, NULL, NULL, 'Регулировка в движении', 'Коррекции 135/128\r\nСлабая динамика на бензине, на газе лучше.', 39, '2018-09-12 10:13:31', '2018-09-12 10:16:21'),
(34, 197599, NULL, 'Неустойчивый холостой ход, повышенный расход топлива', NULL, 'Установка свечного зазора 0,8 мм, \r\nРегулировка по ШДК.', NULL, 40, '2018-09-13 06:23:41', '2018-09-13 06:39:02'),
(35, 58000, 'Множественные пропуски воспламенения', 'Газовые инжектора полностью открыты', NULL, 'Регулировка газовых форсунок, замены фильтров грубой и тонкой очистки. Проверка в движении.', 'Машина на временных номерах.', 41, '2018-09-13 07:48:57', '2018-09-13 08:25:44'),
(36, 69800, 'Ошибки по смеси', NULL, NULL, 'Регулировка в движении', 'до регулировки LongShift - \"-15%\", после регулировки LongShift - \"2.7\"', 42, '2018-09-14 14:57:40', '2018-09-14 14:57:40'),
(37, 52181, NULL, NULL, 'Замена свечей', NULL, 'Установлено ГБО', 43, '2018-09-15 10:10:10', '2018-09-15 10:10:27'),
(38, 274439, NULL, NULL, NULL, 'замена фильтров тонкой и грубой очистки', NULL, 44, '2018-09-17 06:20:17', '2018-09-17 06:20:17'),
(39, 148100, NULL, NULL, NULL, 'Замена редуктора, регулировка форсунок, обкатка.', 'На газовом блоке \"спилен\" пробег', 45, '2018-09-17 07:08:23', '2018-09-17 07:08:23'),
(40, 167107, NULL, 'Пробита мембрана редуктора', NULL, NULL, NULL, 46, '2018-09-17 10:41:01', '2018-09-17 10:41:28'),
(41, 288559, 'Расходомер воздуха слишком низкий уровень сигнала. \r\nОбеднённая смесь на холостом ходу.', NULL, NULL, 'Переборка редуктора.', NULL, 47, '2018-09-18 06:45:26', '2018-09-18 06:56:53'),
(42, 0, 'Ошибка по датчику дроссельной заслонки(обломана защёлкана фишке)', 'Низкое давление газа', NULL, 'Диагностика, подкидка датчика MAP GoFast', 'Клиент сам менял фильтры. Вентиль на баллоне был недооткрыт. Фильтр тонкой очистки установлен не той стороной, очевидно это привело к выходу из строя датчика MAP.', 48, '2018-09-18 06:51:26', '2018-09-18 06:51:26'),
(43, 208779, NULL, NULL, NULL, 'Переборка редуктора. Регулировка в движении.', NULL, 49, '2018-09-18 08:01:54', '2018-09-18 08:38:14'),
(44, 288607, NULL, NULL, NULL, 'Регулировка хода штока форсунок', NULL, 47, '2018-09-19 05:29:47', '2018-09-19 05:29:47'),
(45, 192250, NULL, NULL, NULL, 'Замена фильтров тонкой и грубой очистки', 'Очень медленная работа датчика кислорода. Подозрение на загрязнение бензиновых форсунок.', 50, '2018-09-19 07:23:51', '2018-09-19 08:00:12'),
(46, 39050, 'Богатая смесь по второму датчику кислорода.', NULL, NULL, NULL, '500 км назад менялись фильтра.\r\nПодозрение на забитый катализатор.', 51, '2018-09-20 03:34:47', '2018-09-20 03:36:46'),
(47, 355255, NULL, NULL, NULL, 'Замена редуктора и форсунок. Обкатка', NULL, 52, '2018-09-20 08:34:30', '2018-09-20 08:34:53'),
(48, 139786, NULL, NULL, NULL, 'Замена фильтров тонкой и грубой очистки', NULL, 53, '2018-09-20 10:46:06', '2018-09-20 10:46:40'),
(49, 186860, NULL, NULL, NULL, 'Замена редуктора и форсунок, замена фильтра тонкой очистки', NULL, 54, '2018-09-21 06:00:24', '2018-09-21 06:29:48'),
(50, 155280, NULL, NULL, NULL, 'Регулировка хода штока форсунок, обкатка', 'Ход штока был 0,2 мм', 55, '2018-09-21 09:57:45', '2018-09-21 09:58:08'),
(51, 90887, NULL, NULL, NULL, 'Повысили температуру переключения на газ', NULL, 56, '2018-09-21 10:51:52', '2018-09-21 10:51:52'),
(52, 393382, NULL, 'Нестабильный холостой ход, продёргивания в ходу.', NULL, NULL, NULL, 57, '2018-09-21 11:05:30', '2018-09-21 11:05:30'),
(53, 84328, 'Пропуски 1,3 цил. Ошибка катализатиора', 'Нет связи с блоком, окислены контакты в разъёме', NULL, 'Устранение утечек газа по низкому давлению (на MAP датчике и на выходе редуктора).', NULL, 58, '2018-09-26 08:44:50', '2018-09-26 08:46:54'),
(54, 105640, NULL, 'Богатая смесь на газе', NULL, 'Регулировка, обкатка', NULL, 59, '2018-09-27 06:04:06', '2018-09-27 06:04:06'),
(55, 288904, 'Переобеднение смеси, непостоянно', NULL, NULL, NULL, NULL, 47, '2018-09-27 07:13:19', '2018-09-27 07:15:57'),
(56, 152924, NULL, NULL, NULL, 'Замена редуктора', NULL, 60, '2018-09-27 10:06:44', '2018-09-27 10:06:44'),
(57, 68142, NULL, NULL, NULL, 'Регулировка в движении', 'Долгосрочная коррекция на холостом ходу после регулировки - 1,6%', 61, '2018-09-27 12:36:03', '2018-09-27 12:38:10'),
(58, 267427, NULL, NULL, NULL, 'Установлено ГБО', NULL, 62, '2018-09-28 06:56:13', '2018-09-28 06:56:13'),
(59, 62500, 'Обеднённая смесь на газе', NULL, NULL, 'Автокалибровка, отключение автоадаптации, настройка в движении', NULL, 63, '2018-09-29 05:23:04', '2018-09-29 05:23:04'),
(60, 141464, NULL, NULL, NULL, 'Переборка редуктора', NULL, 64, '2018-10-01 08:58:52', '2018-10-01 08:59:31'),
(61, 225121, NULL, NULL, NULL, 'Замена электроники и редуктора', NULL, 65, '2018-10-01 11:38:39', '2018-10-01 11:38:39'),
(62, 168230, NULL, NULL, NULL, 'Замена редуктора', NULL, 46, '2018-10-02 04:56:51', '2018-10-02 04:56:51'),
(63, 247183, NULL, NULL, NULL, 'Замена фильтров тонкой и грубой очистки', NULL, 66, '2018-10-03 09:13:47', '2018-10-03 09:13:47'),
(64, 187331, NULL, NULL, NULL, 'Регулировка в движении', 'Машина \"безлямбдовая\"', 54, '2018-10-03 10:22:58', '2018-10-03 10:35:07'),
(65, 99421, NULL, NULL, NULL, 'Установлено ГБО', NULL, 67, '2018-10-04 06:03:11', '2018-10-04 06:03:11'),
(66, 233021, NULL, NULL, NULL, 'Замена шлангов на тосол и форсунки.', NULL, 68, '2018-10-05 06:32:37', '2018-10-05 06:32:37'),
(67, 84579, 'Низкая эффективность катализатора', 'Давление газа ниже нормы, температура редуктора выше нормы', NULL, 'Регулировка смеси на холостом ходу', NULL, 69, '2018-10-06 04:54:55', '2018-10-06 05:00:25'),
(68, 192529, NULL, NULL, NULL, NULL, 'Нестабильные показания датчика температуры редуктора, возможно проблема с блоком управления ГБО', 37, '2018-10-08 04:09:54', '2018-10-08 04:44:28'),
(69, 185924, 'Бедная смесь', NULL, NULL, NULL, 'Похоже пробита прокладка коллектора', 70, '2018-10-08 10:52:06', '2018-10-08 10:52:06'),
(70, 64122, NULL, NULL, 'Замена свечей на АУ17', 'Чистка газовых форсунок', 'Жалобы на неустойчивый холостой ход, иногда при наборе оборотов засвечивался \"Check Engine\"', 71, '2018-10-09 07:09:05', '2018-10-09 08:56:43'),
(71, 71170, NULL, NULL, NULL, 'Замена редуктора', NULL, 72, '2018-10-11 03:35:18', '2018-10-11 04:42:58'),
(72, 167929, NULL, NULL, NULL, NULL, 'Прошита под Евро 2', 73, '2018-10-11 08:15:11', '2018-10-11 08:15:30'),
(73, 125000, NULL, NULL, NULL, 'Замена фильтра тонкой очистки', NULL, 74, '2018-10-11 11:30:34', '2018-10-11 11:30:34'),
(74, 201596, NULL, NULL, 'Замена уплотнительных колец бензиновых форсунок', NULL, NULL, 75, '2018-10-11 12:14:12', '2018-10-11 12:14:12'),
(75, 254804, 'Множественные пропуски воспламенения', NULL, NULL, 'Замена газовых форсунок, врезка обогрева редуктора от отопителя салона.', 'Проблема с газовым блоком по каналу бензиновой форсунки первого цилиндра, газовый третий цилиндр', 76, '2018-10-12 09:50:56', '2018-10-12 10:23:30');

--
-- Индексы сохранённых таблиц
--

--
-- Индексы таблицы `cars`
--
ALTER TABLE `cars`
  ADD PRIMARY KEY (`id`),
  ADD KEY `state_number` (`state_number`(191));

--
-- Индексы таблицы `visits`
--
ALTER TABLE `visits`
  ADD PRIMARY KEY (`id`),
  ADD KEY `visits_ibfk_1` (`car_id`);

--
-- AUTO_INCREMENT для сохранённых таблиц
--

--
-- AUTO_INCREMENT для таблицы `cars`
--
ALTER TABLE `cars`
  MODIFY `id` int(10) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=77;

--
-- AUTO_INCREMENT для таблицы `visits`
--
ALTER TABLE `visits`
  MODIFY `id` int(10) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=76;

--
-- Ограничения внешнего ключа сохраненных таблиц
--

--
-- Ограничения внешнего ключа таблицы `visits`
--
ALTER TABLE `visits`
  ADD CONSTRAINT `visits_ibfk_1` FOREIGN KEY (`car_id`) REFERENCES `cars` (`id`) ON DELETE CASCADE ON UPDATE CASCADE;
COMMIT;

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
